import { TitleProps } from "./Title.props";

export const titleList: TitleProps[] = [
    {
        title: "Ремонт и Дизайн интерьеров в Беларуси",
        description: "Уникальные авторские и индивидуальные дизайны, проектируем и делаем ремонт под ключ.",
    },
    {
        title: "Услуги по ремонту и отделке",
        description: "Выберите интересующую Вас категорию чтобы узнать подробне о предлагаемых услугах.",
    },
    {
        title: "Наш подход",
        description: "Придерживаемся индивидуального подхода ко всем нашим клиентам. Помогаем в разрешениилюбых возникающих сложностей и трудностей.",
    },
    {
        title: "Примеры выполненных работ",
        description: "Если Вы стремитесь к изяществу, то ничто не сковывает Вашу фантазию. Для Вас изысканные смелые решения или нестареющий классический стиль. Создайте дом, который демонстрирует Ваше чувство стиля и индивидуальность.",
    },
];