import React from 'react';
import styles from "./DocumetPage.module.css";

const UserAgreementContent = () => (
    <>
        <h1 className={styles.title}>Пользовательское соглашение</h1>
        <div className={styles.content}>
            <h2>1. Общие положения</h2>
            <p>1.1. Настоящее Пользовательское соглашение (далее – Соглашение) относится к интернет-сайту
                авторизованного сервисного центра (далее – Интернет-сайт), расположенному по адресу
                https://premium-interior.by/.</p>
            <p>1.2. Интернет-сайт (далее – Сайт) является собственностью ИП Коробова Е.В.</p>
            <p>1.3. Настоящее Соглашение регулирует отношения между администрацией сайта (далее –
                Администрация сайта) и Пользователем данного Сайта.</p>
            <p>1.4. Администрация сайта оставляет за собой право в любое время изменять, добавлять или
                удалять пункты настоящего Соглашения без уведомления Пользователя.</p>
            <p>1.5. Продолжение использования Сайта Пользователем означает принятие Соглашения и изменений,
                внесенных в настоящее Соглашение.</p>
            <p>1.6. Пользователь несет персональную ответственность за проверку настоящего Соглашения на
                наличие изменений в нем.</p>

            <h2>2. Определение терминов</h2>
            <p>2.1. Перечисленные ниже термины имеют для целей настоящего Соглашения следующее значение:</p>
            <p>2.1.1. Интернет-сайт авторизованного сервисного центра – сайт, расположенный на доменном
                имени https://premium-interior.by/, осуществляющий свою деятельность посредством
                Интернет-ресурса и сопутствующих ему сервисов.</p>
            <p>2.1.2. Сайт – это веб-ресурс, содержащий информацию о Товарах, Услугах, Продавце, позволяющий
                осуществить выбор, заказ и (или) приобретение Товара.</p>
            <p>2.1.3. Администрация сайта – уполномоченные сотрудники для управления Сайтом, действующие от
                имени ИП Коробова Е.В.</p>
            <p>2.1.4. Пользователь сайта (далее Пользователь) – лицо, имеющее доступ к Сайту, посредством
                сети Интернет и использующее Сайт.</p>
            <p>2.1.5. Содержание сайта (далее – Содержание) - охраняемые результаты интеллектуальной
                деятельности, включая тексты литературных произведений, их названия, предисловия, аннотации,
                статьи, иллюстрации, обложки, музыкальные произведения с текстом или без текста,
                графические, текстовые, фотографические, производные, составные и иные произведения,
                пользовательские интерфейсы, визуальные интерфейсы, названия товарных знаков, логотипы,
                программы для ЭВМ, базы данных, а также дизайн, структура, выбор, координация, внешний вид,
                общий стиль и расположение данного Содержания, входящего в состав Сайта и другие объекты
                интеллектуальной собственности все вместе и/или по отдельности, содержащиеся на данном
                сайте.</p>
            <h2>3. Предмет соглашения</h2>
            <p>3.1. Предметом настоящего Соглашения является предоставление Пользователю интернет-сайта
                доступа к содержащимся на Сайте Товарам и оказываемым услугам.</p>
            <p>3.1.1. Интернет-сайт предоставляет Пользователю следующие виды услуг (сервисов):</p>
            <ul>
                <li>
                    Доступ к электронному контенту на бесплатной основе, с правом приобретения (скачивания),
                    просмотра контента;
                </li>
                <li>
                    Доступ к средствам поиска и навигации Сайта;
                </li>
                <li>
                    Предоставление Пользователю возможности размещения отзывов о услуге и товаре;
                </li>
                <li>
                    Доступ к информации о услуге и товаре и к информации о приобретении услуги и товара;
                </li>
                <li>
                    Иные виды услуг (сервисов), реализуемые на страницах Сайта.
                </li>
            </ul>
            <p>3.1.2. Под действие настоящего Соглашения подпадают все существующие (реально
                функционирующие) на данный момент услуги (сервисы) Сайта, а также любые их последующие
                модификации и появляющиеся в дальнейшем дополнительные услуги (сервисы) Сайта.</p>
            <p>3.2. Доступ к Сайту предоставляется на бесплатной основе.</p>
            <p>3.3. Настоящее Соглашение является публичной офертой. Получая доступ к Сайту Пользователь
                считается присоединившимся к настоящему Соглашению.</p>
            <p>3.4. Использование материалов и сервисов Сайта регулируется нормами действующего
                законодательства Республики Беларусь.</p>
            <h2>4. Права и обязанности сторон</h2>
            <p>4.1. Администрация сайта вправе:</p>
            <p>4.1.1. Изменять правила пользования Сайтом, а также изменять содержание данного Сайта.
                Изменения вступают в силу с момента публикации новой редакции Соглашения на Сайте.</p>
            <p>4.1.2. Ограничить доступ к Сайту в случае нарушения Пользователем условий настоящего
                Соглашения.</p>
            <p>4.2. Пользователь вправе:</p>
            <p>4.2.1. Знакомиться с материалами и сервисами Сайта, заказывать и приобретать товары и/или
                услуги, предлагаемые на Сайте.</p>
            <p>4.2.2. Задавать любые вопросы, относящиеся к услугам Сайта по реквизитам, которые находятся в
                разделе Сайта «Контакты».</p>
            <p>4.2.3. Пользоваться Сайтом исключительно в целях и порядке, предусмотренных Соглашением и не
                запрещенных законодательством Республики Беларусь.</p>
            <p>4.3. Пользователь Сайта обязуется:</p>
            <p>4.3.1. Дать согласие на обработку персональных данных Администрацией сайта в соответствии с
                Законом Республики Беларусь “О защите персональных данных” от 07.05.2021 №99-З. Обработка
                персональных данных Пользователя регулируется действующим законодательством Республики
                Беларусь и Политикой конфиденциальности Сайта.</p>
            <p>4.3.2. Предоставлять по запросу Администрации сайта дополнительную информацию, которая имеет
                непосредственное отношение к предоставляемым услугам данного Сайта.</p>
            <p>4.3.3. Соблюдать имущественные и неимущественные права авторов и иных правообладателей при
                использовании Сайта.</p>
            <p>4.3.4. Не предпринимать действий, которые могут рассматриваться как нарушающие нормальную
                работу Сайта.</p>
            <p>4.3.5. Не распространять с использованием Сайта любую конфиденциальную и охраняемую
                законодательством Республики Беларусь информацию о физических либо юридических лицах.</p>
            <p>4.3.6. Избегать любых действий, в результате которых может быть нарушена конфиденциальность
                охраняемой законодательством Республики Беларусь информации.</p>
            <p>4.3.7. Не использовать Сайт для распространения информации рекламного характера, иначе как с
                согласия Администрации сайта.</p>
            <p>4.3.8. Не использовать сервисы Сайта с целью:</p>
            <ul>
                <li>
                    Загрузки контента, который является незаконным, нарушает любые права третьих лиц;
                    пропагандирует насилие, жестокость, ненависть и (или) дискриминацию по расовому,
                    национальному, половому, религиозному, социальному признакам; содержит недостоверные
                    сведения и (или) оскорбления в адрес конкретных лиц, организаций, органов власти.
                </li>
                <li>
                    Побуждения к совершению противоправных действий, а также содействия лицам, действия
                    которых направлены на нарушение ограничений и запретов, действующих на территории
                    Республики Беларусь.
                </li>
                <li>
                    Нарушения прав несовершеннолетних лиц и (или) причинение им вреда в любой форме.
                </li>
                <li>
                    Ущемления прав меньшинств.
                </li>
                <li>
                    Представления себя за другого человека или представителя организации и (или) сообщества
                    без достаточных на то прав, в том числе за сотрудников данного Сайта.
                </li>
                <li>
                    Введения в заблуждение относительно свойств и характеристик какого-либо товара или
                    услуги из каталога Сайта.
                </li>
                <li>
                    Некорректного сравнения товара или услуги, а также формирования негативного отношения к
                    лицам, (не) пользующимся определенными товарами и услугами, или осуждения таких лиц.
                </li>
            </ul>
            <p>4.4. Пользователю запрещается:</p>
            <p>4.4.1. Использовать любые устройства, программы, процедуры, алгоритмы и методы,
                автоматические устройства или эквивалентные ручные процессы для доступа, приобретения,
                копирования или отслеживания содержания данного Сайта.</p>
            <p>4.4.2. Нарушать надлежащее функционирование Сайта;</p>
            <p>4.4.3. Любым способом обходить навигационную структуру Сайта для получения или попытки
                получения любой информации, документов или материалов любыми средствами, которые специально
                не представлены сервисами данного Сайта;</p>
            <p>4.4.4. Несанкционированный доступ к функциям Сайта, любым другим системам или сетям,
                относящимся к данному Сайту, а также к любым услугам, предлагаемым на Сайте.</p>
            <p>4.4.5. Нарушать систему безопасности или аутентификации на Сайте.</p>
            <p>4.4.6. Выполнять обратный поиск, отслеживать или пытаться отслеживать любую информацию о
                любом другом Пользователе Сайта.</p>
            <p>4.4.7. Использовать Сайт и его Содержание в любых целях, запрещенных законодательством
                Республики Беларусь, а также подстрекать к любой незаконной деятельности или другой
                деятельности, нарушающей права Сайта или других лиц.</p>
            <h2>5. Использование сайта</h2>
            <p>5.1. Сайт и Содержание, входящее в состав Сайта, принадлежит и управляется Администрацией
                сайта.</p>
            <p>5.2. Содержание Сайта не может быть скопировано, опубликовано, воспроизведено, передано или
                распространено любым способом, а также размещено в глобальной сети «Интернет» без
                предварительного письменного согласия Администрации сайта.</p>
            <p>5.3. Содержание Сайта защищено авторским правом, законодательством о товарных знаках, а также
                другими правами, связанными с интеллектуальной собственностью, и законодательством о
                недобросовестной конкуренции.</p>
            <p>5.4. Приобретение Товара, предлагаемого на Сайте, может потребовать создания учётной записи
                Пользователя.</p>
            <p>5.5. Пользователь несет персональную ответственность за сохранение конфиденциальности
                информации учётной записи, включая пароль, а также за всю без исключения деятельность,
                которая ведётся от имени Пользователя учётной записи.</p>
            <p>5.6. Пользователь должен незамедлительно уведомить Администрацию сайта о несанкционированном
                использовании его учётной записи или пароля, или любом другом нарушении системы
                безопасности.</p>
            <p>5.7. Администрация сайта обладает правом в одностороннем порядке аннулировать учетную запись
                Пользователя, если она не использовалась более 12 календарных месяцев подряд без уведомления
                Пользователя.</p>
            <p>5.8. Настоящее Соглашение распространяет свое действия на все дополнительные положения и
                условия о покупке Товара и оказанию услуг, предоставляемых на Сайте.</p>
            <p>5.9. Информация, размещаемая на Сайте, не должна истолковываться как изменение настоящего
                Соглашения.</p>
            <p>5.10. Администрация сайта имеет право в любое время без уведомления Пользователя вносить
                изменения в перечень товаров и услуг, предлагаемых на Сайте, и (или) в цены, применимые к
                таким товарам по их реализации и (или) оказываемым услугам интернет-сайтом.</p>
            <p>5.11. Документы, указанные в пунктах 5.11.1 - 5.11.4 настоящего Соглашения регулируют в
                соответствующей части и распространяют свое действие на использование Пользователем Сайта. В
                настоящее Соглашение включены следующие документы:</p>
            <p>5.11.1. Политика конфиденциальности;</p>
            <p>5.11.2. Согласие на использование персональных данных;</p>
            <p>5.11.3. Уведомление о использовании cookies;</p>
            <p>5.11.4. Заявка на оформление заказа.</p>
            <p>5.12. Любой из документов, перечисленных в пункте 5.11. настоящего Соглашения может подлежать
                обновлению. Изменения вступают в силу с момента их опубликования на Сайте.</p>
            <h2>6. Ответственность</h2>
            <p>6.1. Любые убытки, которые Пользователь может понести в случае умышленного или неосторожного
                нарушения любого положения настоящего Соглашения, а также вследствие несанкционированного
                доступа к коммуникациям другого Пользователя, Администрацией сайта не возмещаются.</p>
            <p>6.2. Администрация сайта не несет ответственности за:</p>
            <p>6.2.1. Задержки или сбои в процессе совершения операции, возникшие вследствие непреодолимой
                силы, а также любого случая неполадок в телекоммуникационных, компьютерных, электрических и
                иных смежных системах.</p>
            <p>6.2.2. Надлежащее функционирование Сайта, в случае если Пользователь не имеет необходимых
                технических средств для его использования, а также не несет никаких обязательств по
                обеспечению пользователей такими средствами.</p>
            <p>6.2.3. За посещение и использование Пользователем внешних ресурсов, ссылки на которые могут
                содержаться на Сайте. Пользователь переходит по ссылкам, содержащимся на Сайте на внешние
                ресурсы, по своему усмотрению на свой страх и риск.</p>
            <p>6.2.4. Действия систем переводов, банков, платежных систем и за задержки, связанные с их
                работой.</p>
            <h2>7. Нарушение условий пользовательского соглашения</h2>
            <p>7.1. Администрация сайта вправе раскрыть любую собранную о Пользователе данного Сайта
                информацию, если раскрытие необходимо в связи с расследованием или жалобой в отношении
                неправомерного использования Сайта либо для установления (идентификации) Пользователя,
                который может нарушать или вмешиваться в права Администрации сайта или в права других
                Пользователей Сайта.</p>
            <p>7.2. Администрация сайта имеет право раскрыть любую информацию о Пользователе, которую
                посчитает необходимой для выполнения положений действующего законодательства или судебных
                решений, обеспечения выполнения условий настоящего Соглашения, защиты прав или безопасности
                ИП Коробова Е.В. и других пользователей.</p>
            <p>7.3. Администрация сайта имеет право раскрыть информацию о Пользователе, если действующее
                законодательство Республики Беларусь требует или разрешает такое раскрытие.</p>
            <p>7.4. Администрация сайта вправе без предварительного уведомления Пользователя прекратить и
                (или) заблокировать доступ к Сайту, если Пользователь нарушил настоящее Соглашение или
                содержащиеся в иных документах условия пользования Сайтом, а также в случае прекращения
                действия Сайта либо по причине технической неполадки или проблемы.</p>
            <p>7.5. Администрация сайта не несет ответственности перед Пользователем или третьими лицами за
                прекращение доступа к Сайту в случае нарушения Пользователем любого положения настоящего
                Соглашения или иного документа, содержащего условия пользования Сайтом.</p>
            <h2>8. Разрешение споров</h2>
            <p>8.1. В случае возникновения любых разногласий или споров между Сторонами настоящего
                Соглашения обязательным условием до обращения в суд является предъявление претензии
                (письменного предложения о добровольном урегулировании спора).</p>
            <p>8.2. Получатель претензии в течение 30 рабочих дней со дня ее получения, письменно уведомляет
                заявителя претензии о результатах рассмотрения претензии.</p>
            <p>8.3. При невозможности разрешить спор в добровольном порядке любая из Сторон вправе
                обратиться в суд за защитой своих прав, которые предоставлены им действующим
                законодательством Республики Беларусь.</p>
            <p>8.4. Любой иск в отношении условий использования Сайта должен быть предъявлен в течение 3
                календарных дней после возникновения оснований для иска, за исключением защиты авторских
                прав на охраняемые в соответствии с законодательством материалы Сайта. При нарушении условий
                данного пункта любой иск или основания для иска погашаются исковой давностью.</p>
            <h2>9. Дополнительные условия</h2>
            <p>9.1. Администрация сайта не принимает встречные предложения от Пользователя относительно
                изменений настоящего Пользовательского соглашения.</p>
            <p>9.2. Отзывы Пользователя, размещенные на Сайте, не являются конфиденциальной информацией и
                могут быть использованы Администрацией сайта без ограничений.</p>
        </div>
        <p className={styles.date}>Дата публикации: {"04.01.2025"}</p>
    </>
);

export default UserAgreementContent;
