import React from 'react';
import styles from "../../styles/DocumetPage.module.css";

const PrivacyPolicyContent = () => (
    <>
        <h1 className={styles.title}>Политика конфиденциальности</h1>
        <div className={styles.content}>
            <p>Настоящая Политика конфиденциальности персональных данных (далее – Политика
                конфиденциальности) действует в отношении всей информации, которую Интернет-ресурс по
                ремонту, дизайну интерьера, отделке помещений и квартир в Республике Беларусь, расположенный
                на доменном
                имени https://premium-interior.by/.может получить о Пользователе во время использования
                сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и квартир в
                Республике Беларусь, программ и продуктов Интернет-ресурса.</p>
            <h2>1. Определение терминов</h2>
            <p>1.1. В настоящей Политике конфиденциальности используются следующие термины:</p>
            <p>1.1.1. «Администрация сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений
                и квартир в Республике Беларусь (далее – Администрация сайта)» – уполномоченные сотрудники
                на управления сайтом, действующие от имени ИП Коробова Е.В., которые организуют и (или)
                осуществляет обработку персональных данных, а также определяет цели обработки персональных
                данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с
                персональными данными.</p>
            <p>1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно
                определенному, или определяемому физическому лицу (субъекту персональных данных).</p>
            <p>1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий
                (операций), совершаемых с использованием средств автоматизации или без использования таких
                средств с персональными данными, включая сбор, запись,
                систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
                использование, передачу (распространение, предоставление, доступ), обезличивание,
                блокирование, удаление, уничтожение персональных данных.</p>
            <p>1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или
                иным получившим доступ к персональным данным лицом требование не допускать их
                распространения без согласия субъекта персональных данных или наличия иного законного
                основания.</p>
            <p>1.1.5. «Пользователь сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и
                квартир в Республике Беларусь (далее - Пользователь)» – лицо, имеющее доступ к Сайту,
                посредством сети Интернет и использующее Сайт Интернет-ресурс по ремонту, дизайну интерьера,
                отделке помещений и квартир в Республике Беларусь.</p>
            <p>1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на
                компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-
                серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</p>
            <p>1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по
                протоколу IP.</p>
            <h2>2. Общие положения</h2>
            <p>2.1. Использование Пользователем сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке
                помещений и квартир в Республике Беларусь., означает согласие с настоящей Политикой
                конфиденциальности и условиями обработки персональных данных Пользователя.
                В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить
                использование сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и
                квартир в Республике Беларусь.</p>
            <p>2.2. Настоящая Политика конфиденциальности применяется только к сайту Интернет-ресурс по
                ремонту, дизайну интерьера, отделке помещений и квартир в Республике Беларусь
                https://premium-interior.by/. Интернет-ресурс по ремонту, дизайну интерьера, отделке
                помещений и квартир в Республике Беларусь не контролирует и не несет
                ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам,
                доступным на сайте Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и
                квартир в Республике Беларусь.</p>
            <p>2.3. Администрация сайта не проверяет достоверность персональных данных, предоставляемых
                Пользователем сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и
                квартир в Республике Беларусь.</p>
            <h2>3. Предмет политики конфиденциальности</h2>
            <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства
                Администрации сайта Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и
                квартир в Республике Беларусь, по неразглашению и обеспечению режима защиты
                конфиденциальности персональных данных, которые Пользователь предоставляет по запросу
                Администрации сайта при регистрации на сайте Интернет-ресурс по ремонту, дизайну интерьера,
                отделке помещений и квартир в Республике Беларусь, или при оформлении заказа для
                приобретения Услуги или товара.</p>
            <p>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики
                конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на
                Сайте Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и квартир в
                Республике Беларусь, https://premium-interior.by/. в разделах Формы оформления заказа и
                Формы подписки на
                рассылку и включают в себя следующую информацию:</p>
            <ul>
                <li>
                    фамилию, имя, отчество Пользователя;
                </li>
                <li>
                    контактный телефон Пользователя;
                </li>
            </ul>
            <p>3.3. Интернет-ресурс защищает Данные, которые автоматически передаются в процессе просмотра
                рекламных блоков и при посещении страниц, на которых установлен
                статистический скрипт системы ( &quot;пиксель&quot; ):</p>
            <ul>
                <li>
                    IP адрес;
                </li>
                <li>
                    информация из cookies;
                </li>
                <li>
                    информация о браузере (или иной программе, которая осуществляет доступ к показу
                    рекламы);
                </li>
                <li>
                    время доступа;
                </li>
                <li>
                    адрес страницы, на которой расположен рекламный блок;
                </li>
                <li>
                    Референт (адрес предыдущей страницы).
                </li>
            </ul>
            <p>3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-
                ресурса, требующим авторизации.</p>
            <p>3.3.2. Интернет-ресурс по ремонту, дизайну интерьера, отделке помещений и квартир в
                Республике Беларусь осуществляет сбор статистики об IP-адресах своих посетителей. Данная
                информация используется с целью выявления и решения технических проблем, для контроля
                законности проводимых финансовых платежей.</p>
            <p>3.4. Любая иная персональная информация, не оговоренная выше (история покупок, используемые
                браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за
                исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики
                конфиденциальности.</p>
            <h2>4. Цели сбора персональной информации пользователей:</h2>
            <p>4.1. Персональные данные Пользователя Администрация сайта интернет-ресурса может использовать
                в целях:</p>
            <ul>
                <li>
                    Идентификации Пользователя, зарегистрированного на сайте Интернет-ресурс по ремонту,
                    дизайну интерьера, отделке помещений и квартир в Республике Беларусь, для оформления
                    заказа
                    и (или) заключения Договора купли-продажи услуги или товара дистанционным способом с
                    https://premium-interior.by/.
                </li>
                <li>
                    Предоставления Пользователю доступа к персонализированным ресурсам Сайта
                    интернет-ресурса.
                </li>
                <li>
                    Установления с Пользователем обратной связи, включая направление уведомлений,
                    запросов, касающихся использования Сайта интернет-ресурса, оказания услуг, обработка
                    запросов и заявок от Пользователя.
                </li>
                <li>
                    Определения места нахождения Пользователя для обеспечения безопасности, предотвращения
                    мошенничества.
                </li>
                <li>
                    Подтверждения достоверности и полноты персональных данных, предоставленных
                    Пользователем.
                </li>
                <li>
                    Создания учетной записи для совершения покупок, если Пользователь дал согласие на
                    создание учетной записи.
                </li>
                <li>
                    Уведомления Пользователя Сайта интернет-ресурса о состоянии Заказа.
                </li>
                <li>
                    Обработки и получения платежей, подтверждения налога или налоговых льгот,
                    оспаривания платежа, определения права на получение кредитной линии Пользователем.
                </li>
                <li>
                    Предоставления Пользователю эффективной клиентской и технической поддержки при
                    возникновении проблем, связанных с использованием Сайта интернет-ресурса.
                </li>
                <li>
                    Предоставления Пользователю с его согласия, обновлений продукции, специальных
                    предложений, информации о ценах, новостной рассылки и иных сведений от имени Интернет-
                    ресурса или от имени партнеров Интернет-ресурса.
                </li>
                <li>
                    Осуществления рекламной деятельности с согласия Пользователя.
                </li>
                <li>
                    Предоставления доступа Пользователю на сайты или сервисы партнеров Интернет- ресурса
                    с целью получения продуктов, обновлений и услуг.
                </li>
            </ul>
            <h2>5. Способы и сроки обработки персональной информации</h2>
            <p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым
                законным способом, в том числе в информационных системах персональных данных с
                использованием средств автоматизации или без использования таких средств.</p>
            <p>5.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать
                персональные данные третьим лицам, в частности, операторам электросвязи, исключительно в
                целях выполнения заказа Пользователя, оформленного на Сайте интернет-ресурса
                https://premium-interior.by/, включая оказание услуги.</p>
            <p>5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам
                государственной власти Республики Беларусь только по основаниям и в порядке, установленным
                законодательством Республики Беларусь.</p>
            <p>5.4. При утрате или разглашении персональных данных Администрация сайта информирует
                Пользователя об утрате или разглашении персональных данных.</p>
            <p>5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты
                персональной информации Пользователя от неправомерного или случайного доступа, уничтожения,
                изменения, блокирования, копирования, распространения, а также от иных неправомерных
                действий третьих лиц.</p>
            <p>5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по
                предотвращению убытков или иных отрицательных последствий, вызванных утратой или
                разглашением персональных данных Пользователя.</p>
            <h2>6. Обязательства сторон</h2>
            <p>6.1. Пользователь обязан:</p>
            <ul>
                <li>
                    Предоставить информацию о персональных данных, необходимую для пользования Сайтом
                    интернет-ресурса.
                </li>
                <li>
                    Обновить, дополнить предоставленную информацию о персональных данных в случае
                    изменения данной информации.
                </li>
            </ul>
            <p>6.2. Администрация сайта обязана:</p>
            <ul>
                <li>
                    Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей
                    Политики конфиденциальности.
                </li>
                <li>
                    Обеспечить хранение конфиденциальной информации в тайне, не разглашать без
                    предварительного письменного разрешения Пользователя, а также не осуществлять продажу,
                    обмен, опубликование, либо разглашение иными возможными способами переданных
                    персональных
                    данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики
                    Конфиденциальности.
                </li>
                <li>
                    Принимать меры предосторожности для защиты конфиденциальности персональных данных
                    Пользователя согласно порядку, обычно используемого для защиты такого рода информации в
                    существующем деловом обороте.
                </li>
                <li>
                    Осуществить блокирование персональных данных, относящихся к соответствующему
                    Пользователю, с момента обращения или запроса Пользователя, или его законного
                    представителя
                    либо уполномоченного органа по защите прав субъектов персональных данных на период
                    проверки,
                    в случае выявления недостоверных персональных данных или неправомерных действий.
                </li>
            </ul>
            <h2>7. Ответственность сторон</h2>
            <p>7.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки,
                понесённые Пользователем в связи с неправомерным использованием персональных данных, в
                соответствии с законодательством Республики Беларусь, за исключением случаев,
                предусмотренных п.п. 5.2., 5.3. и 6.2. настоящей Политики Конфиденциальности. </p>
            <p>7.2. В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт
                ответственность, если данная конфиденциальная информация:</p>
            <ul>
                <li>
                    Стала публичным достоянием до её утраты или разглашения.
                </li>
                <li>
                    Была получена от третьей стороны до момента её получения Администрацией сайта.
                </li>
                <li>
                    Была разглашена с согласия Пользователя.
                </li>
            </ul>
            <h2>8. Разрешение споров</h2>
            <p>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта
                Интернет-ресурса и Администрацией сайта, обязательным является предъявление претензии
                (письменного предложения о добровольном урегулировании спора).</p>
            <p>8.2. Получатель претензии в течение 30 рабочих дней со дня получения претензии, письменно
                уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
            <p>8.3. При не достижении соглашения спор будет передан на рассмотрение в суд в соответствии с
                действующим законодательством Республики Беларусь.</p>
            <p>8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и
                Администрацией сайта применяется действующее законодательство Республики Беларусь.</p>
            <p>8.1. Была разглашена с согласия Пользователя.</p>
            <h2>9. Дополнительные условия</h2>
            <p>9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без
                согласия Пользователя.</p>
            <p>9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте
                интернет-ресурса, если иное не предусмотрено новой редакцией Политики
                конфиденциальности.</p>
            <p>9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать по
                адресу электронной почты: premium-interior@tut.by</p>
            <p>9.4. Действующая Политика конфиденциальности размещена на странице по адресу
                https://premium-interior.by/.Политика-конфиденциальности</p>
        </div>
        <p className={styles.date}>Дата публикации: 05.01.2025</p>
    </>
);

export default PrivacyPolicyContent;
